# @Author：颜凡
# @File  ：Day05.py
# @Time  ：2026/3/20 19:43
"""
找出100~999之间的所有水仙花数
水仙花数是各位立方和等于这个数本身的数
如: 153 = 1**3 + 5**3 + 3**3

i=100
while i<=999:
    if i == (i//100)**3+(i//10%10)**3+(i%10)**3:
        print(i)
    i=i+1
"""

"""
判断输入的正整数是不是回文数
回文数是指将一个正整数从左往右排列和从右往左排列值一样的数


num = int(input("请输入一个正整数："))
if num > 0:
    n1 = num
    n2 = 0
    while n1 > 0:
        n2 = n2 * 10
        n2 += n1 % 10
        # n2 = n2 * 10  如果先取余再而后×10则后面将多出一个0
        n1 = n1 // 10
    if n2 == num:
        print("这个数是回文数")
    else:
        print("这个数不是回文数")
"""

"""
求解《百钱百鸡》问题
1只公鸡5元 1只母鸡3元 3只小鸡1元 用100元买100只鸡
问公鸡 母鸡 小鸡各有多少只

for a in range(0, 20):
    for b in range(0, 33):
        c = 100 - a - b
        if a * 5 + 3 * b + c / 3 == 100:
            print('公鸡: %d只, 母鸡: %d只, 小鸡: %d只' % (a, b, c))
"""